Repository: yben27/emacslispref
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: fr_fr

source: The value of this variable is the version of Emacs being run. It is a string such as @code{"20.3.1"}. The last number in this string is not really part of the Emacs release version number; it is incremented each time you build Emacs in any given directory. A value with four numeric components, such as @code{"20.3.9.1"}, indicates an unreleased test version.
fr_fr: La valeur de cette variable est la version d'Emacs en cours. C'est une chaine telle que @code{"20.3.1"}. Le dernier nombre dans cette chaine n'est pas vraiment une partie du nombre de version de sortie d'Emacs ; il est incrémenté chaque fois que vous construisez Emacs dans n'importe quel répertoire donné. Une valeur avec quatre composants numériques, tels que @code{"20.3.9.1"}, indique une version d'essai non sortie.

source: The value, @var{weak}, must be one of @code{nil}, @code{key}, @code{value}, @code{key-or-value}, @code{key-and-value}, or @code{t} which is an alias for @code{key-and-value}. If @var{weak} is @code{key} then the hash table does not prevent its keys from being collected as garbage (if they are not referenced anywhere else); if a particular key does get collected, the corresponding association is removed from the hash table.
fr_fr: La valeur de @var{weak} doit prendre une des valeurs suivantes @code{nil}, @code{key}, @code{value}, @code{key-or-value}, @code{key-and-value} ou @code{t} qui est un alias pour @code{key-and-value}. Si @var{weak} a pour valeur @var{key} alors la table de hachage n'empêche pas ses clés d'être détruites par le ramasse-miettes (si elles ne sont référencées nulle part ailleurs) ; si une clé particulière se fait ramasser, l'association correspondante est retirée de la table de hachage.

source: The weakness of a hash table specifies whether the presence of a key or value in the hash table preserves it from garbage collection.
fr_fr: La valeur de faiblesse d'une table de hachage spécifie si la présence d'une clé ou d'une valeur dans la table de hachage la préserve de la récupération par le ramasse-miettes.

source: There are four functions to convert floating point numbers to integers; they differ in how they round. All accept an argument @var{number} and an optional argument @var{divisor}. Both arguments may be integers or floating point numbers. @var{divisor} may also be @code{nil}. If @var{divisor} is @code{nil} or omitted, these functions convert @var{number} to an integer, or return it unchanged if it already is an integer. If @var{divisor} is non-@code{nil}, they divide @var{number} by @var{divisor} and convert the result to an integer. An @code{arith-error} results if @var{divisor} is 0.
fr_fr: Il y a quatre fonctions pour convertir des nombres à virgule flottante en nombres entiers ; ils diffèrent dans la façon dont ils arrondissent. Tous acceptent un argument @var{number} et un argument facultatif @var{divisor}. Les deux arguments peuvent être des nombres entiers ou des nombres à virgule flottante. @var{divisor} peut également être @code{nil}. Si @var{divisor} est @code{nil} ou omis, ces fonctions convertissent @var{number} en nombre entier, ou le renvoient sans changement si c'est déjà un nombre entier. Si @var{divisor} est non-@code{nil}, elles divisent @var{number} par @var{divisor} et convertissent le résultat en nombre entier. Un @code{arith-error} en résulte si @var{divisor} est 0.

source: There are two special functions for working with bool-vectors; aside from that, you manipulate them with same functions used for other kinds of arrays.
fr_fr: Il y a deux fonctions particulières pour le travail avec les vecteurs-booléen ; à part cela, on les manipule avec les mêmes fonctions que pour les autres types de tableaux.

source: There are two text representations for non-@acronym{ASCII} characters in Emacs strings (and in buffers): unibyte and multibyte (@pxref{Text Representations}). An @acronym{ASCII} character always occupies one byte in a string; in fact, when a string is all @acronym{ASCII}, there is no real difference between the unibyte and multibyte representations. For most Lisp programming, you don't need to be concerned with these two representations.
fr_fr: Il y a deux façons de représenter le texte pour les caractères non-@acronym{ASCII} dans les chaînes d’Emacs (et dans les mémoires tampons) : l'uni- octet et le multi-octet (voir la section @xref{Text Representations}). Un caractère @acronym{ASCII} occupe toujours un octet dans une chaîne ; en fait, quand une chaîne est entièrement en @acronym{ASCII}, il n’y a pas de réelle différence entre les représentations uni-octet etmulti-octet . Pour la plupart des programmes Lisp, vous n’avez pas besoin de vous préoccuper de ces deux représentations.

source: There is another wrinkle: because floating point arithmetic is not exact, it is often a bad idea to check for equality of two floating point values. Usually it is better to test for approximate equality. Here's a function to do this:
fr_fr: Il y a un autre problème : parce que l'arithmétique de virgule flottante n'est pas exacte, c'est souvent une mauvaise idée de vérifier l'égalité de deux valeurs à virgule flottante. Habituellement il vaut mieux déterminer l'égalité approximative. Voici une fonction pour faire ceci:

source: There is no argument to specify the length of the char-table, because all char-tables have room for any valid character code as an index.
fr_fr: Il n'existe pas d'argument pour spécifier la longueur d'une char-table parce que toutes les char-table ont de la place pour tout code de caractère valide comme indice.

source: There is no special function to access default values in a char-table. To do that, use @code{char-table-range} (see below).
fr_fr: Il n'y a pas de fonction particulière pour accéder aux valeurs par défaut d'une char-table. Pour cela, il faut utiliser @code{char-table-range} (voir ci-dessous).

source: There is no way to share structure between two hash tables, the way two alists can share a common tail.
fr_fr: Il n'est pas possible de partager une structure entre deux tables de hachage, contrairement à deux listes d'association dont la queue de liste peut être commune.

source: Therefore,
fr_fr: Par conséquent,

source: These are the ordinary trigonometric functions, with argument measured in radians.
fr_fr: Ce sont les fonctions trigonométriques ordinaires, avec l'argument mesuré en radians.

source: These facilities provide information about which version of Emacs is in use.
fr_fr: Ces fonctions fournissent les informations au sujet de la version d'Emacs en service.

source: These functions do not modify the strings that are passed to them as arguments.
fr_fr: Ces fonctions ne modifient pas les chaînes qui leur sont passées en arguments.

source: These mathematical functions allow integers as well as floating point numbers as arguments.
fr_fr: Ces fonctions mathématiques autorisent des nombres entiers aussi bien que des nombres à virgule flottante comme arguments.

source: These results make sense because the binary codes for control-_ and control-W are 11111 and 10111, respectively.
fr_fr: Ces résultats ont un sens parce que les codes binaires pour control-_ et control-W sont respectivement 11111 et 10111.

source: They occupy one-fourth the space of a vector of the same elements.
fr_fr: Ils occupent un quart de l'espace d'un tableau type @code{vector} contenant les mêmes éléments.

source: This Info file contains edition @value{VERSION} of the GNU Emacs Lisp Reference Manual, corresponding to GNU Emacs version @value{EMACSVER}.
fr_fr: Ce dossier d'information contient l'édition @value{VERSION} du Manuel de référence GNU Emacs Lisp, correspondant à la version @value{EMACSVER} de GNU Emacs.

source: This chapter describes a number of features related to the display that Emacs presents to the user.
fr_fr: Ce chapitre décrit des fonctions en rapport avec l'affichage qu'Emacs présente à l'utilisateur.

source: This command displays a description of the contents of the current buffer's case table.
fr_fr: Cette commande affiche une description du contenu du tableau de casse du tampon courant.

source: This example creates a hash table whose keys are strings that are compared case-insensitively.
fr_fr: Cet exemple crée une table de hachage dont les clés sont des chaînes de caractères qui sont comparées sans tenir compte de la casse.

source: This function acts like @code{eq} except when both arguments are numbers. It compares numbers by type and numeric value, so that @code{(eql 1.0 1)} returns @code{nil}, but @code{(eql 1.0 1.0)} and @code{(eql 1 1)} both return @code{t}.
fr_fr: Cette fonction agit comme @code{eq} sauf quand les deux arguments sont des nombres. Elle compare des nombres par le type et la valeur numérique, de sorte que @code{(eql 1.0 1)} renvoie le @code{nil}, mais @code{(eql 1.0 1.0)} et @code{(eql 1 1)} renvoient tous les deux le @code{t}.

source: This function adds its arguments together. When given no arguments, @code{+} returns 0.
fr_fr: Cette fonction fait la somme de ses arguments. Si aucun argument n'est donné, @code{+} retourne 0.

source: This function alters part of the contents of the string @var{string}, by storing @var{obj} starting at index @var{idx}. The argument @var{obj} may be either a character or a (smaller) string.
fr_fr: Cette fonction modifie une partie du contenu de la chaîne @var{string}: elle stocke @var{obj} en commençant à l'indice @var{idx}. L'argument @var{obj} peut être soit un caractère soit une (plus petite) chaîne.

source: This function calls @var{function} for each element of @var{char-table}. @var{function} is called with two arguments, a key and a value. The key is a possible @var{range} argument for @code{char-table-range}---either a valid character or a generic character---and the value is @code{(char-table-range @var{char-table} @var{key})}.
fr_fr: Cette fonction appelle @var{function} pour chaque élément de la @var{char-table}. On appelle @var{function} et on lui passe deux arguments, une clé et une valeur. La clé est une valeur possible pour l'argument @var{range} de la fonction @code{char-table-range} --- soit un caractère valide, soit un caractère générique --- et la valeur est @code{(char-table-range @var{char-table} @var{key})}.

source: This function calls @var{function} once for each of the associations in @var{table}. The function @var{function} should accept two arguments---a @var{key} listed in @var{table}, and its associated @var{value}. @code{maphash} returns @code{nil}.
fr_fr: Cette fonction appelle une fois @var{function} pour chacune des associations de @var{table}. Il faut que @var{function} prenne deux arguments --- une clé @var{key} présente dans @var{table} et sa valeur associée @var{value}. @var{maphash} retourne @var{nil}.

source: This function capitalizes strings or characters. If @var{string-or-char} is a string, the function creates and returns a new string, whose contents are a copy of @var{string-or-char} in which each word has been capitalized. This means that the first character of each word is converted to upper case, and the rest are converted to lower case.
fr_fr: Cette fonction met en majuscules les chaînes ou les caractères. Si @var{string-or-char} est une chaîne, la fonction crée et retourne une nouvelle chaîne, dont le contenu est une copie de @var{string-or-char} dans laquelle chaque mot a été mis en majuscule. Cela signifie que le premier caractère de chaque mot est converti en majuscule, et que le reste est converti en minuscule.

source: This function compares the specified part of @var{string1} with the specified part of @var{string2}. The specified part of @var{string1} runs from index @var{start1} up to index @var{end1} (@code{nil} means the end of the string). The specified part of @var{string2} runs from index @var{start2} up to index @var{end2} (@code{nil} means the end of the string).
fr_fr: Cette fonction compare la partie spécifiée de @var{string1} avec la partie spécifiée de @var{string2}. La partie spécifiée de @var{string1} va de l'indice @var{start1} jusqu'à l'indice @var{end1} (@code{nil} signifie la fin de la chaîne). La partie spécifiée de @var{string2} va de l'indice @var{start2} jusqu'à l'indice @var{end2} (@code{nil} signifie la fin de la chaîne).

source: This function compares two strings a character at a time. It scans both the strings at the same time to find the first pair of corresponding characters that do not match. If the lesser character of these two is the character from @var{string1}, then @var{string1} is less, and this function returns @code{t}. If the lesser character is the one from @var{string2}, then @var{string1} is greater, and this function returns @code{nil}. If the two strings match entirely, the value is @code{nil}.
fr_fr: Cette fonction compare deux chaînes de caractères à la fois. Elle scanne les deux chaînes en même temps pour trouver la première paire de caractères correspondants qui ne sont pas les mêmes. Si le moindre caractère de ces deux est le caractère de @var{string1}, alors @var{string1} est moindre, et cette fonction retourne @code{t}. Si le moindre caractère est celui de @var{string2}, alors @var{string1} est plus grand, et cette fonction retourne @code{nil}. Si les deux chaînes correspondent entièrement, la valeur est @code{nil}.

source: This function converts a character or a string to lower case.
fr_fr: Cette fonction convertit un caractère ou une chaîne en minuscules

source: This function converts a character or a string to upper case.
fr_fr: Cette fonction convertit un caractère ou une chaîne en majuscules.

source: This function creates a new hash table according to the specified arguments. The arguments should consist of alternating keywords (particular symbols recognized specially) and values corresponding to them.
fr_fr: Cette fonction crée une nouvelle table de hachage selon les arguments spécifiés. Les arguments doivent être une alternance de mots-clés différents (surtout des symboles particulièrement reconnus) et des valeurs qui leur correspondent.

source: This function creates and returns a copy of @var{table}. Only the table itself is copied---the keys and values are shared.
fr_fr: Cette fonction crée et retourne une copie de @var{table}. Seule la table elle-même est copiée ; les clés et les valeurs sont partagées.

source: This function creates and returns a new, empty abbrev table---an obarray containing no symbols. It is a vector filled with zeros.
fr_fr: Cette fonction crée et renvoie une nouvelle table vide d'abréviations---une liste ne contient aucun symbole---. C'est un vecteur rempli de zéros.

source: This function creates and returns a vector whose elements are the arguments, @var{objects}.
fr_fr: Cette fonction crée et retourne un vecteur dont les éléments sont les arguments @var{objects}.

source: This function defines @var{tabname} (a symbol) as an abbrev table name, i.e., as a variable whose value is an abbrev table. It defines abbrevs in the table according to @var{definitions}, a list of elements of the form @code{(@var{abbrevname} @var{expansion} @var{hook} @var{usecount} @var{system-flag})}. If an element of @var{definitions} has length less than five, omitted elements default to @code{nil}. A value of @code{nil} for @var{usecount} is equivalent to zero. The return value is always @code{nil}.
fr_fr: Cette fonction définit @var{tabname} (un symbole) comme le nom d'une table d'abréviations, c.-à-d., comme variable dont la valeur est une table d'abréviations. Elle définit les abréviations dans la table selon @var{definitions}, une liste d'éléments de forme @code{(@var{abbrevname} @var{expansion} @var{hook} @var{usecount} @var{system-flag})}. Si un élément de @var{definitions} a la longueur inférieure à cinq, les éléments omis par défaut sont @code{nil}. Une valeur de @code{nil} pour @var{usecount} est équivalente à zéro. La valeur de retour est toujours @code{nil}.

source: This function defines a new hash table test, named @var{name}.
fr_fr: Cette fonction définit un nouveau test de table de hachage, appelée @var{name}.

source: This function defines an abbrev named @var{name}, in @var{table}, to expand to @var{expansion} and call @var{hook}. The return value is @var{name}.
fr_fr: Cette fonction définit une abréviation appelée @var{name}, dans @var{table}, à développer @var{expansion} et appeler @var{hook}. La valeur de retour est @var{name}.

source: This function divides @var{dividend} by @var{divisor} and returns the quotient. If there are additional arguments @var{divisors}, then it divides @var{dividend} by each divisor in turn. Each argument may be a number or a marker.
fr_fr: Cette fonction divise @var{dividend} par @var{divisor} et retourne le quotient. S'il y a des arguments additionnels @var{divisors}, il divise @var{dividend} par chaque diviseur alternativement. Chaque argument peut être un nombre ou un marqueur.

source: This function does not work for dotted lists. Trying to copy a circular list may cause an infinite loop.
fr_fr: Cette fonction ne marche pas pour les listes pointées. Copier une liste circulaire risque d'entraîner une boucle infinie.

source: This function enters an association for @var{key} in @var{table}, with value @var{value}. If @var{key} already has an association in @var{table}, @var{value} replaces the old associated value.
fr_fr: Cette fonction insère une association avec pour clé @var{key} et pour valeur @var{value} dans la table de hachage @code{table}. Si @var{key} a déjà une association dans @var{table}, @var{value} remplace l'ancienne valeur associée.

source: This function fills the array @var{array} with @var{object}, so that each element of @var{array} is @var{object}. It returns @var{array}.
fr_fr: Cette fonction remplit le tableau @var{array} avec @var{object}, de telle façon que chaque élément du tableau @var{array} soit de type @var{object}. Elle renvoie un tableau de type @var{array}.

source: This function generalizes @code{aref} (@pxref{Array Functions}) and @code{nth} (@pxref{Definition of nth}).
fr_fr: Cette fonction généralise @code{aref} (@pxref{Array Functions}) et@code{nth} (@pxref{Definition of nth})

source: This function inserts before point a description of the abbrev table named @var{name}. The argument @var{name} is a symbol whose value is an abbrev table. The return value is always @code{nil}.
fr_fr: Cette fonction insère avant le point une description de la table d'abréviations avant nommé @var{name}. L'argument @var{name} est un symbole dont la valeur est la table d'abréviations. La valeur de retour est toujours @code{nil}.

source: This function is not analogous to the C operator @code{++}---it does not increment a variable. It just computes a sum. Thus, if we continue,
fr_fr: Cette fonction n'est pas analogue à l'opérateur C @code{++} ---elle n'incrémente pas une variable---. Elle calcule juste la somme. Ainsi, si nous continuons,

source: This function is obsolete. Use @code{make-hash-table} instead.
fr_fr: Cette fonction est obsolète. Utilisez @code{make-hash-table} à la place.

source: This function looks up @var{key} in @var{table}, and returns its associated @var{value}---or @var{default}, if @var{key} has no association in @var{table}.
fr_fr: Cette fonction recherche la valeur @var{key} dans la table @var{table}, et retourne sa valeur associée @var{value} --- ou la valeur @var{default} si @var{key} n'a pas d'association dans la table @var{table}.

source: This function makes @var{char} case-invariant, with syntax @var{syntax}.
fr_fr: Cette fonction rend @var{char} invariant à la casse, avec la syntaxe @var{syntax}.

source: This function makes @var{table} the standard case table, so that it will be used in any buffers created subsequently.
fr_fr: Cette fonction transforme @var{table} en un tableau de casse normale pour qu'il puisse être utilisé par n'importe quel tampon créé par la suite.

source: This function makes characters @var{l} and @var{r} a matching pair of case-invariant delimiters.
fr_fr: Cette fonction crée une paire correspondante de délimiteurs invariants à la casse avec les caractères @var{l} et @var{r}.

source: This function may be eliminated in the future if it does not seem useful enough to retain.
fr_fr: Cette fonction peut être éliminée à l'avenir si elle ne semble pas être assez utile pour être conservée.

source: This function multiplies its arguments together, and returns the product. When given no arguments, @code{*} returns 1.
fr_fr: Cette fonction multiplie ses arguments entre elles, et renvoie le produit. Si aucun argument n'est donné, @code{*} retourne 1.

source: This function removes all the associations from hash table @var{table}, so that it becomes empty. This is also called @dfn{clearing} the hash table.
fr_fr: Cette fonction retire toutes les associations de la table de hachage @var{table}, de sorte qu'elle devienne vide. Cela s'appelle aussi @dfn{nettoyer} la table de hachage.

source: This function removes the association for @var{key} from @var{table}, if there is one. If @var{key} has no association, @code{remhash} does nothing.
fr_fr: Cette fonction retire de la table @var{table} l'association ayant comme clé @var{key}, s'il y en a une. Si @var{key} n'a pas d'association, @code{remhash} ne fait rien.

source: This function returns @code{t} if @var{object} is a char-table, otherwise @code{nil}.
fr_fr: Cette fonction retourne @code{t} si @var{object} est une char-table, sinon @code{nil}.

source: This function returns @code{t} if @var{object} is a string or a character (i.e., an integer), @code{nil} otherwise.
fr_fr: Cette function retourne @code{t} si @var{objet} est une chaîne ou un caractère (c-à-d un entier), sinon @code{nil}.

source: This function returns @code{t} if @var{object} is a string or nil, @code{nil} otherwise.
fr_fr: Cette fonction retourne @code{t} si @var{objet} est une chaîne ou nil, sinon @code{nil}.

source: This function returns @code{t} if @var{object} is a string, @code{nil} otherwise.
fr_fr: Cette fonction retourne @code{t} si @var{objet} est une chaîne, sinon @code{nil}.

source: This function returns @code{t} if @var{object} is a symbol, @code{nil} otherwise.
fr_fr: Cette fonction renvoie @code{t} si l'@var{objet} est un symbole et autrement @code{nil}.

source: This function returns @code{t} if @var{object} is a vector.
fr_fr: Cette fonction retourne @code{t} si @var{object} est un vecteur.

source: This function returns @code{t} if @var{object} is an array (i.e., a vector, a string, a bool-vector or a char-table).
fr_fr: Cette fonction retourne @code{t} si @var{object} est un tableau (c'est-à-dire un vecteur, une chaîne de caractères, un booléen-vecteur ou une table de caractères).

source: This function returns @code{t} if the arguments represent the same character, @code{nil} otherwise. This function ignores differences in case if @code{case-fold-search} is non-@code{nil}.
fr_fr: Cette fonction retourne @code{t} si les arguments représentent les mêmes caractères, sinon @code{nil}. Cette fonction ignore la casse si case-fold-search est non @code{nil}.

source: This function returns @code{t} if the characters of the two strings match exactly. Symbols are also allowed as arguments, in which case their print names are used. Case is always significant, regardless of @code{case-fold-search}.
fr_fr: Cette fonction retourne @code{t} si les caractères de deux chaînes correspondent exactement. Les symboles sont également autorisés comme arguments, dans ce cas leurs noms sont utilisés. La casse a toujours de l'importance, quel que soit @code{case-fold-search}.

source: This function returns @var{number-or-marker} minus 1.
fr_fr: Cette fonction renvoie @var{number-or-marker} moins 1.

source: This function returns @var{number-or-marker} plus 1. For example,
fr_fr: Cette fonction renvoie @var{number-or-marker} plus 1. Par exemple,
